ionesconsole/iones-firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_MCPWM_ISR_HANDLER_IN_IRAM=n
CONFIG_RMT_ENCODER_FUNC_IN_IRAM=n
CONFIG_RMT_TX_ISR_HANDLER_IN_IRAM=n
CONFIG_RMT_RX_ISR_HANDLER_IN_IRAM=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_FREERTOS_HZ=1000
CONFIG_TFT_BGR_ORDER=y
CONFIG_TFT_HSPI_PORT=y
CONFIG_TFT_MISO=13
CONFIG_TFT_MOSI=11
CONFIG_TFT_SCLK=12
CONFIG_TFT_SPI_FREQUENCY=79990000
CONFIG_TFT_CS=10
CONFIG_TFT_DC=8
CONFIG_TFT_RST=18
CONFIG_ENABLE_BL=n
CONFIG_ELF_LOADER_CUSTOMER_SYMBOLS=y
